test/after1_stress.log
ubuntu@ip-192-168-13-44:~/search$ k6 run --out influxdb=http://localhost:8086/myk6db stress.js

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: stress.js
     output: InfluxDBv1 (http://localhost:8086)

  scenarios: (100.00%) 1 scenario, 600 max VUs, 2m40s max duration (incl. graceful stop):
           * default: Up to 600 looping VUs for 2m10s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)

WARN[0051] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"
WARN[0052] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"
WARN[0052] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"
WARN[0052] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": EOF"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": read tcp 192.168.13.44:44502->52.78.66.68:443: read: connection reset by peer"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": EOF"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": EOF"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": EOF"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": read tcp 192.168.13.44:44536->52.78.66.68:443: read: connection reset by peer"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": read tcp 192.168.13.44:44542->52.78.66.68:443: read: connection reset by peer"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": EOF"
WARN[0053] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": EOF"
WARN[0054] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"
WARN[0054] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"
WARN[0054] Request Failed                                error="Get \"https://saerang.r-e.kr//paths?source=3&target=7\": EOF"
WARN[0054] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"
WARN[0054] Request Failed                                error="Get \"https://saerang.r-e.kr//path\": EOF"

running (2m40.0s), 000/600 VUs, 14590 complete and 74 interrupted iterations
default ✓ [======================================] 000/600 VUs  2m10s

     ✗ retrieved path
      ↳  12% — ✓ 1883 / ✗ 12781
     ✗ path res
      ↳  13% — ✓ 1898 / ✗ 12695

     checks.........................: 12.92% ✓ 3781       ✗ 25476
     data_received..................: 63 MB  392 kB/s
     data_sent......................: 11 MB  68 kB/s
     http_req_blocked...............: avg=2.1ms    min=0s     med=0s       max=38.37ms p(90)=4.78ms   p(95)=5.93ms
     http_req_connecting............: avg=1.03ms   min=0s     med=676.75µs max=26.93ms p(90)=1.54ms   p(95)=2.9ms
   ✗ http_req_duration..............: avg=954.98ms min=0s     med=0s       max=39.81s  p(90)=699.32ms p(95)=8.92s
       { expected_response:true }...: avg=6.27s    min=1.34ms med=2.18s    max=39.81s  p(90)=14.78s   p(95)=15.2s
     http_req_failed................: 87.07% ✓ 25476      ✗ 3781
     http_req_receiving.............: avg=32.7µs   min=0s     med=0s       max=29.03ms p(90)=94.25µs  p(95)=113.93µs
     http_req_sending...............: avg=69.52µs  min=0s     med=0s       max=31.62ms p(90)=49.3µs   p(95)=68.64µs
     http_req_tls_handshaking.......: avg=1.66ms   min=0s     med=0s       max=36.79ms p(90)=3.8ms    p(95)=4.6ms
     http_req_waiting...............: avg=954.88ms min=0s     med=0s       max=39.81s  p(90)=699.23ms p(95)=8.92s
     http_reqs......................: 29257  182.853502/s
     iteration_duration.............: avg=2.88s    min=1s     med=1s       max=42s     p(90)=9.44s    p(95)=16.38s
     iterations.....................: 14590  91.18613/s
     vus............................: 1      min=1        max=600
     vus_max........................: 600    min=600      max=600

ERRO[0161] some thresholds have failed